
#ifndef __BSP_IAP_H
#define __BSP_IAP_H

/*-----------------------------------------------------------
 * Includes files
 *----------------------------------------------------------*/
/* lib includes. */
#include <stdint.h>

/*-----------------------------------------------------------
 * Exported constants
 *----------------------------------------------------------*/


/*-----------------------------------------------------------
 * Exported macro
 *----------------------------------------------------------*/
#define FLASH_PROGRAM_ADDR						(0x08008000)
#define FLASH_JUMP_ADDR							(FLASH_PROGRAM_ADDR)

/*-----------------------------------------------------------
 * Exported function
 *----------------------------------------------------------*/

/*!
* @brief 跳转到应用程序段
*        执行条件：无
* @param[in1] : 用户代码起始地址.
*
* @retval: 无
*/
void jump_to_app(uint32_t appxaddr);


#endif /* __BSP_IAP_H */
